In [1]:
import numpy as np 
import pandas as pd

In [3]:
first_series = pd.Series(list('abcdef'))

In [4]:
print(first_series)

0    a
1    b
2    c
3    d
4    e
5    f
dtype: object

In [5]:
np_country = np.array(['Luxemborg','Norway','Japan','Switzerland','United States ','Qatar','Iceland','Sweden','Singapore','Denmark'])

In [6]:
s_country = pd.Series(np_country )

In [7]:
print(s_country)

0         Luxemborg
1            Norway
2             Japan
3       Switzerland
4    United States
5             Qatar
6           Iceland
7            Sweden
8         Singapore
9           Denmark
dtype: object

# Create Series form dict

In [8]:
dict_country_gdp = pd.Series([52056.01781,40258.80863,40034.85063,39578.07441,39170.41371,37958.23146,37691.02733,36152.666,34706.19047,33630.24604,33529.83052,30860.12802],index=['Luxemborg','Macao','China','Norway','Japan','Switzerland','United States ','Qatar','Iceland','Sweden','Singapore','Denmark'] )

In [9]:
print(dict_country_gdp)

Luxemborg         52056.01781
Macao             40258.80863
China             40034.85063
Norway            39578.07441
Japan             39170.41371
Switzerland       37958.23146
United States     37691.02733
Qatar             36152.66600
Iceland           34706.19047
Sweden            33630.24604
Singapore         33529.83052
Denmark           30860.12802
dtype: float64

# Create Series form scalar

In [10]:
scalar_series = pd.Series(5.,index = ['a','b','c','d','e'])

In [11]:
scalar_series

a    5.0
b    5.0
c    5.0
d    5.0
e    5.0
dtype: float64

# Accessing Elements in Series

In [12]:
dict_country_gdp[0]

52056.01781

In [13]:
dict_country_gdp[0:5]

Luxemborg    52056.01781
Macao        40258.80863
China        40034.85063
Norway       39578.07441
Japan        39170.41371
dtype: float64

In [14]:
dict_country_gdp.loc['Norway']

39578.07441

In [15]:
dict_country_gdp.iloc[0]

52056.01781

# Vectorized Operations in Series

In [16]:
v1 = pd.Series ([1,2,3,4],index = ['a','b','c','d'])
v2 = pd.Series([10,20,30,40],index = ['a','b','c','d'])
v3 = v1+v2

In [17]:
v3

a    11
b    22
c    33
d    44
dtype: int64

In [18]:
v1 = pd.Series ([10,20,30,40],index = ['a','b','c','d'])

In [19]:
v1+v2

a    20
b    40
c    60
d    80
dtype: int64

In [20]:
v2 = pd.Series([10,20,30,40],index = ['a','b','e','f'])

In [21]:
v1+v2

a    20.0
b    40.0
c     NaN
d     NaN
e     NaN
f     NaN
dtype: float64

# Data Frame

# Create Data Frame From Lists

In [22]:
import pandas as pd 
Olympic_data_set ={ 'HostCity':['London','Beijing','Athens','Sydeny','Atlanta'],
                 'Year' :[2012,2008,2004,2000,1996],
                 'No_Of_Particpating_Countries':[205,204,201,200,197]
                 }

In [23]:
df_olympic = pd.DataFrame(Olympic_data_set)

In [24]:
print(df_olympic)

  HostCity  Year  No_Of_Particpating_Countries
0   London  2012                           205
1  Beijing  2008                           204
2   Athens  2004                           201
3   Sydeny  2000                           200
4  Atlanta  1996                           197

In [25]:
df_olympic

  HostCity  Year  No_Of_Particpating_Countries
0   London  2012                           205
1  Beijing  2008                           204
2   Athens  2004                           201
3   Sydeny  2000                           200
4  Atlanta  1996                           197

# Create Data Frame Dict of Dictinaries

In [26]:
olympic_data_dict = { 'London':{2012:205},'Beijing':{2008:204}}

In [27]:
df_olympic_data_dict = pd.DataFrame(olympic_data_dict)

In [28]:
df_olympic_data_dict

      London  Beijing
2008     NaN    204.0
2012   205.0      NaN

# View Data Frame

In [29]:
df_olympic.HostCity

0     London
1    Beijing
2     Athens
3     Sydeny
4    Atlanta
Name: HostCity, dtype: object

In [30]:
df_olympic.describe

<bound method NDFrame.describe of   HostCity  Year  No_Of_Particpating_Countries
0   London  2012                           205
1  Beijing  2008                           204
2   Athens  2004                           201
3   Sydeny  2000                           200
4  Atlanta  1996                           197>

In [31]:
df_olympic.Year

0    2012
1    2008
2    2004
3    2000
4    1996
Name: Year, dtype: int64

In [32]:
df_olympic.No_Of_Particpating_Countries

0    205
1    204
2    201
3    200
4    197
Name: No_Of_Particpating_Countries, dtype: int64

# Creat Data Frame From the dict of Series

In [33]:
osp = pd.Series([205,204,201,200,197],index=[2012,2008,2004,2000,1996])
osc = pd.Series(['London','Beijing','Athens','Sydney','Atlanta'],index = [2012,2008,2004,2000, 1996])

In [34]:
df_os = pd.DataFrame({'Countries':osp,'HostCities':osc})

In [35]:
df_os

      Countries HostCities
2012        205     London
2008        204    Beijing
2004        201     Athens
2000        200     Sydney
1996        197    Atlanta

In [36]:
df_os.describe

<bound method NDFrame.describe of       Countries HostCities
2012        205     London
2008        204    Beijing
2004        201     Athens
2000        200     Sydney
1996        197    Atlanta>

In [37]:
df_os.head(2)

      Countries HostCities
2012        205     London
2008        204    Beijing

In [38]:
df_os.tail(3)

      Countries HostCities
2004        201     Athens
2000        200     Sydney
1996        197    Atlanta

In [39]:
df_os.index

Int64Index([2012, 2008, 2004, 2000, 1996], dtype='int64')

In [40]:
df_os.columns

Index(['Countries', 'HostCities'], dtype='object')

In [42]:
df_os['HostCities']

2012     London
2008    Beijing
2004     Athens
2000     Sydney
1996    Atlanta
Name: HostCities, dtype: object

In [43]:
df_os['Countries']

2012    205
2008    204
2004    201
2000    200
1996    197
Name: Countries, dtype: int64

In [46]:
for i1,i2 in enumerate(df_os['Countries']) :
    print(i1,i2)

0 205
1 204
2 201
3 200
4 197

In [47]:
df_os.loc[2012]

Countries        205
HostCities    London
Name: 2012, dtype: object

In [48]:
df_os.iloc[0:2]

      Countries HostCities
2012        205     London
2008        204    Beijing

In [49]:
df_os.iat[3,1]

'Sydney'

In [51]:
df_os[df_os['Countries']>200]

      Countries HostCities
2012        205     London
2008        204    Beijing
2004        201     Athens

# Create Data Frame from ndarray

In [86]:
import numpy as np

In [87]:
np_array = np.array([2012,2008,2004,2006])
dict_ndarray = { 'year':np_array}
df_ndarray = pd.DataFrame(dict_ndarray)

In [88]:
df_ndarray

   year
0  2012
1  2008
2  2004
3  2006

# Create Data Frame from Data Frame

In [90]:
df_from_df = pd.DataFrame(df_os)

In [91]:
df_from_df

      Countries HostCities
2012        205     London
2008        204    Beijing
2004        201     Athens
2000        200     Sydney
1996        197    Atlanta

# Data Operation

In [52]:
import pandas as pd

In [68]:
df_movie_rating = pd.DataFrame({'movie1':[5,4,3,3,2,1],
                              'movie2':[4,5,2,3,4,2]},
                             index = ['Tom','Jeff','Peter','Ramu','Ted','Paul'])

In [69]:
df_movie_rating

       movie1  movie2
Tom         5       4
Jeff        4       5
Peter       3       2
Ramu        3       3
Ted         2       4
Paul        1       2

In [73]:
def movie_grade(rating):
    if rating== 5:
        return 'A'
    if rating ==4 :
        return 'B'
    if rating == 3:
        return 'C'
    if rating ==2 :
        return 'D'
    else:
        return 'F'

In [74]:
print(movie_grade(5))

A

In [75]:
df_movie_rating.applymap(movie_grade)

      movie1 movie2
Tom        A      B
Jeff       B      A
Peter      C      D
Ramu       C      C
Ted        D      B
Paul       F      D

# Data Operation with Statistical Functions

In [76]:
df_testScores = pd.DataFrame({'Test1':[95,84,73,88,82,61],
                             'Test2':[74,85,82,73,77,79]},
                            index= ['Kack','Lewis','Patrixk','Rich','Kelly','Paula']
                            )

In [77]:
df_testScores.max()

Test1    95
Test2    85
dtype: int64

In [78]:
df_testScores.mean()

Test1    80.500000
Test2    78.333333
dtype: float64

In [79]:
df_testScores.std()

Test1    11.979149
Test2     4.633213
dtype: float64

# Data Operation Using Groupby

In [80]:
df_president_name = pd.DataFrame(
{'First':['George','Bill','Ronald','Jimmy','George'],
'Last':['Bush','Clinton','Regan','Carter','Washington']})

In [81]:
df_president_name

    First        Last
0  George        Bush
1    Bill     Clinton
2  Ronald       Regan
3   Jimmy      Carter
4  George  Washington

In [82]:
grouped = df_president_name.groupby('First')

In [83]:
grp_data = grouped.get_group('George')
grp_data

    First        Last
0  George        Bush
4  George  Washington

# Data Operation - Sorting

In [84]:
df_president_name.sort_values('First')

    First        Last
1    Bill     Clinton
0  George        Bush
4  George  Washington
3   Jimmy      Carter
2  Ronald       Regan

In [85]:
df_president_name.sort_values('Last')

    First        Last
0  George        Bush
3   Jimmy      Carter
1    Bill     Clinton
2  Ronald       Regan
4  George  Washington

# Data Stanrdization

In [88]:
df_testScores = pd.DataFrame({'Test1':[95,84,73,88,82,61],
                             'Test2':[74,85,82,73,77,79]},
                            index= ['Kack','Lewis','Patrixk','Rich','Kelly','Paula']
                            )

In [91]:
def standardize_tests(test):
    return(test -test.mean())/test.std()

In [92]:
standardize_tests(df_testScores['Test1'])

Kack       1.210437
Lewis      0.292174
Patrixk   -0.626088
Rich       0.626088
Kelly      0.125218
Paula     -1.627829
Name: Test1, dtype: float64

In [93]:
def standardize_test_scores(datafrm):
    return datafrm.apply(standardize_tests)

In [94]:
standardize_test_scores(df_testScores)

            Test1     Test2
Kack     1.210437 -0.935276
Lewis    0.292174  1.438886
Patrixk -0.626088  0.791387
Rich     0.626088 -1.151109
Kelly    0.125218 -0.287777
Paula   -1.627829  0.143889

# Data operation

In [95]:
import pandas as pd

In [97]:
# Math Students
df_student_math = pd.DataFrame({'student':['Tom','Jack','Dab','Ram','JEff','David'],
                               'ID': [10,56,31,85,9,22]})

In [106]:
df_student_math

  student  ID
0     Tom  10
1    Jack  56
2     Dab  31
3     Ram  85
4    JEff   9
5   David  22

In [107]:
# Science Data
df_student_science = pd.DataFrame({'student':['Tom','Ram','David'],
                               'ID': [10,12,22]})

In [108]:
df_student_science

  student  ID
0     Tom  10
1     Ram  12
2   David  22

In [99]:
# merge
pd.merge(df_student_math,df_student_science)

  student  ID
0     Tom  10
1   David  22

In [100]:
pd.merge(df_student_math,df_student_science,on ='student')

  student  ID_x  ID_y
0     Tom    10    10
1     Ram    85    12
2   David    22    22

In [101]:
pd.merge(df_student_math,df_student_science,on ='ID',how ='left').fillna('X')

  student_x  ID student_y
0       Tom  10       Tom
1      Jack  56         X
2       Dab  31         X
3       Ram  85         X
4      JEff   9         X
5     David  22     David

In [103]:
# concatenate data frames 
pd.concat([df_student_math,df_student_science],ignore_index=True)

  student  ID
0     Tom  10
1    Jack  56
2     Dab  31
3     Ram  85
4    JEff   9
5   David  22
6     Tom  10
7     Ram  12
8   David  22

In [109]:
# define new data
df_student_survey_data = pd.DataFrame({'student':['Tom','Jack','Dab','Ram','JEff','Kack'],
                               'ID': [10,56,10,85,9,56]})

In [110]:
df_student_survey_data

  student  ID
0     Tom  10
1    Jack  56
2     Dab  10
3     Ram  85
4    JEff   9
5    Kack  56

In [111]:
df_student_survey_data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
dtype: bool

In [113]:
df_student_survey_data.drop_duplicates('student')

  student  ID
0     Tom  10
1    Jack  56
2     Dab  10
3     Ram  85
4    JEff   9
5    Kack  56

In [114]:
df_student_survey_data.drop_duplicates('ID')

  student  ID
0     Tom  10
1    Jack  56
3     Ram  85
4    JEff   9

# File Read and Write Support

In [236]:
import pandas as pd

In [237]:
import sqlite3

In [238]:
create_table = """ CREATE TABLE student_score 
(Id INTEGER,Name VARCHAR(20),Math REAL, Science REAL);"""

In [239]:
# execute the SQL statement
executeSQL = sqlite3.connect(':memory:')
executeSQL.execute(create_table)
executeSQL.commit()

In [240]:
#prepare a sQL Query
SQL_query = executeSQL.execute('select *from student_score')

In [241]:
resulset = SQL_query.fetchall()

In [242]:
resulset

[]

# Pandas SQL operation

In [243]:
# Prepare Records to insert
insertSQL = [(10,'Jack',85,92),(12,'Seenu',75,99),(20,'Seven',65,82),(19,'Palguni',95,95)
            ]

In [244]:
# insert Records
insert_statement = "Insert into student_score values(?,?,?,?)"
executeSQL.executemany(insert_statement,insertSQL)
executeSQL.commit()

In [245]:
SQL_query = executeSQL.execute("select *from student_score")

In [246]:
(SQL_query.description)[0]

('Id', None, None, None, None, None, None)

In [247]:
resulset = SQL_query.fetchall()

In [248]:
resulset

[(10, 'Jack', 85.0, 92.0),
 (12, 'Seenu', 75.0, 99.0),
 (20, 'Seven', 65.0, 82.0),
 (19, 'Palguni', 95.0, 95.0)]

In [251]:
SQL_query.description

SyntaxError: can't use starred expression here (<ipython-input-251-ea2d528372df>, line 4)

In [229]:
# put the records together in dataframe
df_student_records = pd.DataFrame(resulset,columns = *SQL_query.description[0:])

In [231]:
df_student_records

   Id     Name  Math Science
  NaN      NaN   NaN     NaN
  NaN      NaN   NaN     NaN
  NaN      NaN   NaN     NaN
  NaN      NaN   NaN     NaN
  NaN      NaN   NaN     NaN
  NaN      NaN   NaN     NaN
0  10     Jack  85.0    92.0
1  12    Seenu  75.0    99.0
2  20    Seven  65.0    82.0
3  19  Palguni  95.0    95.0
4  10     Jack  85.0    92.0
5  12    Seenu  75.0    99.0
6  20    Seven  65.0    82.0
7  19  Palguni  95.0    95.0

In [256]:
# put the records together in dataframe
df_student_records = pd.DataFrame(resulset,columns = zip(* SQL_query.description)[0])

TypeError: 'zip' object is not subscriptable

# Assignment 1

### Analyze the Federal Aviation Authority (FAA) dataset using Pandas to do the following: 

## 1. View 

### $a$ Aircraft make name 
### $b$ State name 
### $c$ Aircraft model name 
### $d$ Text information 
### $e$ Flight phase 
### $f$ Event description type 
### $g$Fatal flag 

## 2. Clean the dataset and replace the fatal flag NaN with No

## 3. Find the aircraft types and their occurrences in the dataset 

## 4. Remove all the observations where aircraft names are not available 

## 5. Display the observations where fatal flag is Yes

In [ ]:
import pandas as pd

In [257]:
df_faa_dataset = pd.read_csv('faa_ai_prelim.csv')

In [258]:
df_faa_dataset.shape

(95, 42)

In [259]:
df_faa_dataset.head(5)

,UPDATED,ENTRY_DATE,EVENT_LCL_DATE,EVENT_LCL_TIME,LOC_CITY_NAME,LOC_STATE_NAME,LOC_CNTRY_NAME,RMK_TEXT,EVENT_TYPE_DESC,FSDO_DESC,...,PAX_INJ_NONE,PAX_INJ_MINOR,PAX_INJ_SERIOUS,PAX_INJ_FATAL,PAX_INJ_UNK,GRND_INJ_NONE,GRND_INJ_MINOR,GRND_INJ_SERIOUS,GRND_INJ_FATAL,GRND_INJ_UNK
0,No,31-OCT-16,28-OCT-16,16:15:00Z,BLOOMFIELD,New Mexico,NaN,AIRCRAFT FORCE LANDED IN A DRY RIVER BED AFTER...,Accident,FAA Albuquerque FSDO-01,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,No,31-OCT-16,29-OCT-16,20:25:00Z,NEW BERN,North Carolina,NaN,"AIRCRAFT SHORTLY AFTER TAKEOFF, CRASHED INTO T...",Accident,FAA Greensboro FSDO-39,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,No,31-OCT-16,28-OCT-16,20:25:00Z,STARBUCK,Washington,NaN,"N369BD EUROCOPTER AS350B ECUREUIL ROTORCRAFT, ...",Accident,FAA Spokane FSDO-13,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,No,31-OCT-16,21-OCT-16,18:00:00Z,LLANO,Texas,NaN,"AIRCRAFT ON LANDING GROUND LOOPED, LLANO, TX",Accident,FAA San Antonio FSDO-17,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,No,31-OCT-16,28-OCT-16,15:00:00Z,ASHERTON,Texas,NaN,N522KC ROBINSON R22 ROTORCRAFT FORCE LANDED NE...,Accident,FAA San Antonio FSDO-17,...,1.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [260]:
df_faa_dataset.columns

Index(['UPDATED', 'ENTRY_DATE', 'EVENT_LCL_DATE', 'EVENT_LCL_TIME',
       'LOC_CITY_NAME', 'LOC_STATE_NAME', 'LOC_CNTRY_NAME', 'RMK_TEXT',
       'EVENT_TYPE_DESC', 'FSDO_DESC', 'REGIST_NBR', 'FLT_NBR', 'ACFT_OPRTR',
       'ACFT_MAKE_NAME', 'ACFT_MODEL_NAME', 'ACFT_MISSING_FLAG',
       'ACFT_DMG_DESC', 'FLT_ACTIVITY', 'FLT_PHASE', 'FAR_PART', 'MAX_INJ_LVL',
       'FATAL_FLAG', 'FLT_CRW_INJ_NONE', 'FLT_CRW_INJ_MINOR',
       'FLT_CRW_INJ_SERIOUS', 'FLT_CRW_INJ_FATAL', 'FLT_CRW_INJ_UNK',
       'CBN_CRW_INJ_NONE', 'CBN_CRW_INJ_MINOR', 'CBN_CRW_INJ_SERIOUS',
       'CBN_CRW_INJ_FATAL', 'CBN_CRW_INJ_UNK', 'PAX_INJ_NONE', 'PAX_INJ_MINOR',
       'PAX_INJ_SERIOUS', 'PAX_INJ_FATAL', 'PAX_INJ_UNK', 'GRND_INJ_NONE',
       'GRND_INJ_MINOR', 'GRND_INJ_SERIOUS', 'GRND_INJ_FATAL', 'GRND_INJ_UNK'],
      dtype='object')

In [262]:
df_analyze_dataset =df_faa_dataset[['ACFT_MAKE_NAME','LOC_STATE_NAME','ACFT_MODEL_NAME','RMK_TEXT','FLT_PHASE',
                                  'EVENT_TYPE_DESC','FATAL_FLAG']]

In [263]:
type(df_analyze_dataset)

pandas.core.frame.DataFrame

In [264]:
df_analyze_dataset.head()

,ACFT_MAKE_NAME,LOC_STATE_NAME,ACFT_MODEL_NAME,RMK_TEXT,FLT_PHASE,EVENT_TYPE_DESC,FATAL_FLAG
0,CIRRUS,New Mexico,SR22,AIRCRAFT FORCE LANDED IN A DRY RIVER BED AFTER...,UNKNOWN (UNK),Accident,NaN
1,PITTS,North Carolina,S1,"AIRCRAFT SHORTLY AFTER TAKEOFF, CRASHED INTO T...",UNKNOWN (UNK),Accident,NaN
2,EUROCOPTER,Washington,AS355,"N369BD EUROCOPTER AS350B ECUREUIL ROTORCRAFT, ...",UNKNOWN (UNK),Accident,NaN
3,CESSNA,Texas,305,"AIRCRAFT ON LANDING GROUND LOOPED, LLANO, TX",LANDING (LDG),Accident,NaN
4,ROBINSON,Texas,R22,N522KC ROBINSON R22 ROTORCRAFT FORCE LANDED NE...,UNKNOWN (UNK),Accident,NaN

In [266]:
df_analyze_dataset['FATAL_FLAG'].fillna(value='No',inplace = True)

C:\Users\thyagaraj\Anaconda3\lib\site-packages\pandas\core\generic.py:6130: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  self._update_inplace(new_data)

In [267]:
df_analyze_dataset.head()

,ACFT_MAKE_NAME,LOC_STATE_NAME,ACFT_MODEL_NAME,RMK_TEXT,FLT_PHASE,EVENT_TYPE_DESC,FATAL_FLAG
0,CIRRUS,New Mexico,SR22,AIRCRAFT FORCE LANDED IN A DRY RIVER BED AFTER...,UNKNOWN (UNK),Accident,No
1,PITTS,North Carolina,S1,"AIRCRAFT SHORTLY AFTER TAKEOFF, CRASHED INTO T...",UNKNOWN (UNK),Accident,No
2,EUROCOPTER,Washington,AS355,"N369BD EUROCOPTER AS350B ECUREUIL ROTORCRAFT, ...",UNKNOWN (UNK),Accident,No
3,CESSNA,Texas,305,"AIRCRAFT ON LANDING GROUND LOOPED, LLANO, TX",LANDING (LDG),Accident,No
4,ROBINSON,Texas,R22,N522KC ROBINSON R22 ROTORCRAFT FORCE LANDED NE...,UNKNOWN (UNK),Accident,No

In [285]:
df_analyze_dataset.shape

(87, 7)

In [286]:
df_final_dataset= df_analyze_dataset.dropna(subset=['ACFT_MAKE_NAME'])

In [287]:
df_final_dataset.shape

(87, 7)

In [288]:
aircraftType= df_final_dataset.groupby('ACFT_MAKE_NAME')

In [289]:
aircraftType .size()

ACFT_MAKE_NAME
AEROSTAR INTERNATIONAL     1
AIR TRACTOR                1
AIRBUS                     1
AVIAT                      3
BEECH                     11
BELL                       1
BOEING                     4
BOMBARDIER                 1
CESSNA                    27
CIRRUS                     2
DIAMOND                    2
EUROCOPTER                 1
GREAT LAKES                1
LANCAIR                    2
MCDONNELL DOUGLAS          1
MOONEY                     3
NORTH AMERICAN             1
PILATUS                    1
PIPER                     10
PITTS                      1
PROGRESSIVE AERODYNE       1
RAYTHEON                   1
ROBINSON                   1
ROCKWELL                   1
STEARMAN                   2
STINSON                    2
VANS                       2
WITTMAN                    1
ZENITH                     1
dtype: int64

In [290]:
fatalAccidents = df_final_dataset.groupby('FATAL_FLAG')

In [291]:
fatalAccidents.size()

FATAL_FLAG
No     81
Yes     6
dtype: int64

In [292]:
accidents_with_fatality = fatalAccidents.get_group('Yes')

In [293]:
accidents_with_fatality

,ACFT_MAKE_NAME,LOC_STATE_NAME,ACFT_MODEL_NAME,RMK_TEXT,FLT_PHASE,EVENT_TYPE_DESC,FATAL_FLAG
5,CESSNA,Alaska,172,AIRCRAFT CRASHED ONTO THE KNIK RIVER BANK UNDE...,UNKNOWN (UNK),Accident,Yes
6,AVIAT,Texas,A1,"AIRCRAFT CRASHED UNDER UNKNOWN CIRCUMSTANCES, ...",UNKNOWN (UNK),Accident,Yes
20,WITTMAN,Texas,W10,"AIRCRAFT CRASHED UNDER UNKNOWN CIRCUMSTANCES, ...",UNKNOWN (UNK),Accident,Yes
21,BEECH,California,36,"AIRCRAFT CRASHED IN A RURAL AREA AND BURNED, T...",UNKNOWN (UNK),Accident,Yes
51,VANS,Wyoming,RV10,AIRCRAFT CRASHED OFF THE AIRPORT AND CAUGHT FI...,UNKNOWN (UNK),Accident,Yes
57,PILATUS,Alaska,PC6,"AIRCRAFT CRASHED UNDER UNKNOWN CIRCUMSTANCES, ...",UNKNOWN (UNK),Accident,Yes

# Assignment 02

### A dataset in CSV format is given for the Fire Department of New York City. Analyze the dataset to determine:

#### 1. The total number of fire department facilities in New York city 
#### 2. The number of fire department facilities in each borough 
#### 3. The facility names in Manhattan

In [1]:
import pandas as pd

In [24]:
df_fdny_csv_data_raw = pd.read_csv('fdny-firehouse-listing.csv')

In [25]:
df_fdny_csv_data_raw.describe()

,Postcode,Latitude,Longitude,Community Board,Community Council,Census Tract,BIN,BBL
count,213.000000,213.000000,213.000000,213.000000,213.000000,213.000000,2.130000e+02,2.130000e+02
mean,10783.774648,40.719125,-73.937440,7.075117,25.629108,5949.535211,2.900421e+06,2.849843e+09
std,556.522394,0.083674,0.093686,7.033880,15.648512,19571.786111,1.306104e+06,1.285511e+09
min,10001.000000,40.512518,-74.238822,1.000000,1.000000,1.000000,1.000867e+06,1.000350e+09
25%,10304.000000,40.663404,-73.987182,3.000000,12.000000,129.000000,2.003268e+06,2.025140e+09
50%,11103.000000,40.715147,-73.938066,6.000000,27.000000,275.000000,3.064786e+06,3.024650e+09
75%,11231.000000,40.774505,-73.886796,11.000000,38.000000,800.000000,4.090228e+06,4.032940e+09
max,11695.000000,40.892803,-73.716559,84.000000,51.000000,157902.000000,5.154879e+06,5.080400e+09

In [26]:
df_fdny_csv_data_raw.head(5)

,FacilityName,FacilityAddress,Borough,Postcode,Latitude,Longitude,Community Board,Community Council,Census Tract,BIN,BBL,NTA
0,Engine 4/Ladder 15,42 South Street,Manhattan,10005.0,40.703466,-74.007538,1.0,1.0,7.0,1000867.0,1.000350e+09,Battery Park City-Lower Manhattan ...
1,Engine 10/Ladder 10,124 Liberty Street,Manhattan,10006.0,40.710072,-74.012523,1.0,1.0,13.0,1075700.0,1.000520e+09,Battery Park City-Lower Manhattan ...
2,Engine 6,49 Beekman Street,Manhattan,10038.0,40.710048,-74.005245,1.0,1.0,1501.0,1001287.0,1.000930e+09,Battery Park City-Lower Manhattan ...
3,Engine 7/Ladder 1/Battalion 1/Manhattan Boroug...,100-104 Duane Street,Manhattan,10007.0,40.715463,-74.005938,1.0,1.0,33.0,1001647.0,1.001500e+09,SoHo-TriBeCa-Civic Center-Little Italy ...
4,Ladder 8,14 North Moore Street,Manhattan,10013.0,40.719759,-74.006678,1.0,1.0,33.0,1002150.0,1.001890e+09,SoHo-TriBeCa-Civic Center-Little Italy ...

In [30]:
df_fdny_csv_data = pd.read_csv('fdny-firehouse-listing.csv')

In [31]:
df_fdny_csv_data.head(5)

,FacilityName,FacilityAddress,Borough,Postcode,Latitude,Longitude,Community Board,Community Council,Census Tract,BIN,BBL,NTA
0,Engine 4/Ladder 15,42 South Street,Manhattan,10005.0,40.703466,-74.007538,1.0,1.0,7.0,1000867.0,1.000350e+09,Battery Park City-Lower Manhattan ...
1,Engine 10/Ladder 10,124 Liberty Street,Manhattan,10006.0,40.710072,-74.012523,1.0,1.0,13.0,1075700.0,1.000520e+09,Battery Park City-Lower Manhattan ...
2,Engine 6,49 Beekman Street,Manhattan,10038.0,40.710048,-74.005245,1.0,1.0,1501.0,1001287.0,1.000930e+09,Battery Park City-Lower Manhattan ...
3,Engine 7/Ladder 1/Battalion 1/Manhattan Boroug...,100-104 Duane Street,Manhattan,10007.0,40.715463,-74.005938,1.0,1.0,33.0,1001647.0,1.001500e+09,SoHo-TriBeCa-Civic Center-Little Italy ...
4,Ladder 8,14 North Moore Street,Manhattan,10013.0,40.719759,-74.006678,1.0,1.0,33.0,1002150.0,1.001890e+09,SoHo-TriBeCa-Civic Center-Little Italy ...

In [32]:
df_fdny_csv_data.describe()

,Postcode,Latitude,Longitude,Community Board,Community Council,Census Tract,BIN,BBL
count,213.000000,213.000000,213.000000,213.000000,213.000000,213.000000,2.130000e+02,2.130000e+02
mean,10783.774648,40.719125,-73.937440,7.075117,25.629108,5949.535211,2.900421e+06,2.849843e+09
std,556.522394,0.083674,0.093686,7.033880,15.648512,19571.786111,1.306104e+06,1.285511e+09
min,10001.000000,40.512518,-74.238822,1.000000,1.000000,1.000000,1.000867e+06,1.000350e+09
25%,10304.000000,40.663404,-73.987182,3.000000,12.000000,129.000000,2.003268e+06,2.025140e+09
50%,11103.000000,40.715147,-73.938066,6.000000,27.000000,275.000000,3.064786e+06,3.024650e+09
75%,11231.000000,40.774505,-73.886796,11.000000,38.000000,800.000000,4.090228e+06,4.032940e+09
max,11695.000000,40.892803,-73.716559,84.000000,51.000000,157902.000000,5.154879e+06,5.080400e+09

In [33]:
df_fdny_csv_data.columns

Index(['FacilityName', 'FacilityAddress', 'Borough', 'Postcode', 'Latitude',
       'Longitude', 'Community Board', 'Community Council ', 'Census Tract',
       'BIN', 'BBL', 'NTA'],
      dtype='object')

In [35]:
df_fdny_csv_data.index

RangeIndex(start=0, stop=218, step=1)

In [21]:
df_fdny_csv_data.count()

Engine 4/Ladder 15                                                             217
42 South Street                                                                217
Manhattan                                                                      217
10005                                                                          212
40.703466                                                                      212
-74.007538                                                                     212
1                                                                              212
1.1                                                                            212
7                                                                              212
1000867                                                                        212
1000350001                                                                     212
Battery Park City-Lower Manhattan                                              212
dtype: int64

In [36]:
df_fdny_csv_data.dtypes

FacilityName           object
FacilityAddress        object
Borough                object
Postcode              float64
Latitude              float64
Longitude             float64
Community Board       float64
Community Council     float64
Census Tract          float64
BIN                   float64
BBL                   float64
NTA                    object
dtype: object

In [37]:
groupby_borough = df_fdny_csv_data.groupby('Borough')

In [38]:
groupby_borough.size()

Borough
Bronx            34
Brooklyn         66
Manhattan        48
Queens           50
Staten Island    20
dtype: int64

In [39]:
fdny_info_Manhattan= groupby_borough.get_group('Manhattan')

In [41]:
fdny_info_Manhattan

,FacilityName,FacilityAddress,Borough,Postcode,Latitude,Longitude,Community Board,Community Council,Census Tract,BIN,BBL,NTA
0,Engine 4/Ladder 15,42 South Street,Manhattan,10005.0,40.703466,-74.007538,1.0,1.0,7.0,1000867.0,1.000350e+09,Battery Park City-Lower Manhattan ...
1,Engine 10/Ladder 10,124 Liberty Street,Manhattan,10006.0,40.710072,-74.012523,1.0,1.0,13.0,1075700.0,1.000520e+09,Battery Park City-Lower Manhattan ...
2,Engine 6,49 Beekman Street,Manhattan,10038.0,40.710048,-74.005245,1.0,1.0,1501.0,1001287.0,1.000930e+09,Battery Park City-Lower Manhattan ...
3,Engine 7/Ladder 1/Battalion 1/Manhattan Boroug...,100-104 Duane Street,Manhattan,10007.0,40.715463,-74.005938,1.0,1.0,33.0,1001647.0,1.001500e+09,SoHo-TriBeCa-Civic Center-Little Italy ...
4,Ladder 8,14 North Moore Street,Manhattan,10013.0,40.719759,-74.006678,1.0,1.0,33.0,1002150.0,1.001890e+09,SoHo-TriBeCa-Civic Center-Little Italy ...
5,Engine 9/Ladder 6,75 Canal Street,Manhattan,10002.0,40.715213,-73.992901,3.0,1.0,16.0,1003898.0,1.003000e+09,Chinatown ...
6,Engine 15/Ladder 18/Battalion 4,25 Pitt Street,Manhattan,10002.0,40.716395,-73.983478,3.0,1.0,12.0,1004078.0,1.003420e+09,Lower East Side ...
7,Engine 28/Ladder 11,222 East 2nd Street,Manhattan,10009.0,40.721682,-73.982622,3.0,2.0,2202.0,1004608.0,1.003850e+09,Lower East Side ...
8,Engine 5,340 East 14th Street,Manhattan,10003.0,40.731752,-73.983536,3.0,2.0,40.0,1006520.0,1.004550e+09,East Village ...
9,Engine 55,363 Broome Street,Manhattan,10013.0,40.720033,-73.995689,2.0,1.0,41.0,1066722.0,1.004700e+09,SoHo-TriBeCa-Civic Center-Little Italy ...
10,Ladder 20/Division 1,253 Lafayette Street,Manhattan,10012.0,40.723072,-73.996804,2.0,1.0,43.0,1007523.0,1.004950e+09,SoHo-TriBeCa-Civic Center-Little Italy ...
11,Engine 24/Ladder 5/Battalion 2,227-29 6th Avenue,Manhattan,10014.0,40.727914,-74.003157,2.0,3.0,37.0,1080044.0,1.005200e+09,SoHo-TriBeCa-Civic Center-Little Italy ...
12,Engine 33/Ladder 9,42 Great Jones Street,Manhattan,10012.0,40.726815,-73.992643,2.0,1.0,5502.0,1008526.0,1.005310e+09,West Village ...
13,Ladder 3/Battalion 6,108 East 13th Street,Manhattan,10003.0,40.733329,-73.989421,3.0,2.0,42.0,1009010.0,1.005580e+09,East Village ...
14,Squad 18,132 West 10th Street,Manhattan,10014.0,40.734625,-74.000346,2.0,3.0,71.0,1010686.0,1.006100e+09,West Village ...
15,Engine 34/Ladder 21,440 West 38th Street,Manhattan,10018.0,40.756635,-73.996217,4.0,3.0,111.0,1012982.0,1.007350e+09,Hudson Yards-Chelsea-Flatiron-Union Square ...
16,Engine 26,220 West 37th Street,Manhattan,10018.0,40.753239,-73.990078,5.0,3.0,109.0,1014447.0,1.007860e+09,Midtown-Midtown South ...
17,Engine 3/Ladder 12/Battalion 7,150 West 19th Street,Manhattan,10011.0,40.741044,-73.996041,4.0,3.0,87.0,1014724.0,1.007940e+09,Hudson Yards-Chelsea-Flatiron-Union Square ...
18,Engine 1/Ladder 24,142-46 West 31st Street,Manhattan,10001.0,40.748430,-73.990447,5.0,3.0,101.0,1015173.0,1.008060e+09,Midtown-Midtown South ...
19,Engine 14,14 East 18th Street,Manhattan,10003.0,40.738143,-73.990964,5.0,2.0,52.0,1016141.0,1.008460e+09,Hudson Yards-Chelsea-Flatiron-Union Square ...
20,Engine 16 / Ladder 7,234 East 29th Street,Manhattan,10016.0,40.742209,-73.979535,6.0,2.0,66.0,1019903.0,1.009090e+09,Murray Hill-Kips Bay ...
21,Engine 21,238 East 40th Street,Manhattan,10016.0,40.748845,-73.973888,6.0,4.0,88.0,1020385.0,1.009200e+09,Turtle Bay-East Midtown ...
22,Engine 54/Ladder 4/Battalion 9,782 8th Avenue,Manhattan,10036.0,40.760792,-73.987182,5.0,3.0,125.0,1024767.0,1.010190e+09,Midtown-Midtown South ...
23,Engine 23,215 West 58th Street,Manhattan,10019.0,40.766544,-73.980350,5.0,4.0,137.0,1024915.0,1.010300e+09,Midtown-Midtown South ...
24,Rescue 1,530 West 43rd Street,Manhattan,10036.0,40.760892,-73.996405,4.0,3.0,129.0,1070109.0,1.010710e+09,Clinton ...
25,Engine 40/Ladder 35,131 Amsterdam Avenue,Manhattan,10023.0,40.774505,-73.984619,7.0,6.0,149.0,1077844.0,1.011378e+09,Lincoln Square ...
26,Ladder 25/District Office 4/Division 3,205-207 West 77th Street,Manhattan,10024.0,40.781992,-73.979627,7.0,6.0,163.0,1030885.0,1.011690e+09,Upper West Side ...
27,Engine 74,120 West 83rd Street,Manhattan,10024.0,40.784881,-73.974434,7.0,6.0,169.0,1032079.0,1.012130e+09,Upper West Side ...
28,Engine 65,33 West 43rd Street,Manhattan,10036.0,40.754676,-73.981610,5.0,4.0,96.0,1076256.0,1.012590e+09,Midtown-Midtown South ...
29,Engine 8 / Ladder 2 / Battalion 8,167 East 51st Street,Manhattan,10022.0,40.756812,-73.971142,6.0,4.0,100.0,1036462.0,1.013060e+09,Turtle Bay-East Midtown ...
30,Engine 39/Ladder 16,157-59 East 67th Street,Manhattan,10065.0,40.766960,-73.963856,8.0,4.0,120.0,1072190.0,1.014020e+09,Upper East Side-Carnegie Hill ...
31,Engine 44,221 East 75th Street,Manhattan,10021.0,40.771427,-73.958521,8.0,4.0,134.0,1044059.0,1.014300e+09,Lenox Hill-Roosevelt Island ...
32,Engine 22/Ladder 13/Battalion 10,159 East 85th Street,Manhattan,10028.0,40.778584,-73.955516,8.0,5.0,14801.0,1047937.0,1.015140e+09,Upper East Side-Carnegie Hill ...
33,Engine 58/Ladder 26,1367 5th Avenue,Manhattan,10029.0,40.798873,-73.947759,11.0,9.0,184.0,1080501.0,1.016180e+09,East Harlem North ...
34,Engine 53/Ladder 43,1836-46 3rd Avenue,Manhattan,10029.0,40.788714,-73.946774,11.0,8.0,166.0,1051850.0,1.016290e+09,East Harlem South ...
35,Engine 91,242 East 111th Street,Manhattan,10029.0,40.794327,-73.941345,11.0,8.0,180.0,1052473.0,1.016600e+09,East Harlem North ...
36,Engine 35/Ladder 14,2282 3rd Avenue,Manhattan,10035.0,40.803129,-73.936244,11.0,8.0,196.0,1054465.0,1.017730e+09,East Harlem North ...
37,Engine 76/Ladder 22/Battalion 11,145-51 West 100th Street,Manhattan,10025.0,40.795924,-73.966726,7.0,7.0,189.0,1055910.0,1.018550e+09,Upper West Side ...
38,Engine 47,502 West 113th Street,Manhattan,10025.0,40.805068,-73.962929,9.0,7.0,199.0,1057000.0,1.018840e+09,Morningside Heights ...
39,Engine 59/Ladder 30,111 West 133rd Street,Manhattan,10030.0,40.813057,-73.942358,10.0,9.0,226.0,1058225.0,1.019180e+09,Central Harlem North-Polo Grounds ...
40,Engine 37/Ladder 40,415 West 125th Street,Manhattan,10027.0,40.811770,-73.954858,9.0,7.0,20901.0,1059547.0,1.019660e+09,Morningside Heights ...
41,Engine 69/Ladder 28/Battalion 16,248 West 143rd Street,Manhattan,10030.0,40.821105,-73.941849,10.0,9.0,232.0,1075491.0,1.020280e+09,Central Harlem North-Polo Grounds ...
42,Engine 80/Ladder 23,503 West 139th Street,Manhattan,10031.0,40.821586,-73.950689,9.0,7.0,225.0,1075504.0,1.020710e+09,Hamilton Heights ...
43,Engine 84/Ladder 34,513 West 161st Street,Manhattan,10032.0,40.835640,-73.940856,12.0,7.0,245.0,1062872.0,1.021200e+09,Washington Heights South ...
44,Engine 67,518 West 170th Street,Manhattan,10032.0,40.841394,-73.936836,12.0,10.0,253.0,1063024.0,1.021260e+09,Washington Heights South ...
45,Engine 93/Ladder 45/Battalion 13,515 West 181st Street,Manhattan,10033.0,40.848398,-73.931516,12.0,10.0,269.0,1075518.0,1.021550e+09,Washington Heights North ...
46,Engine 95/Ladder 36,29 Vermilyea Avenue,Manhattan,10034.0,40.864975,-73.925403,12.0,10.0,291.0,1064801.0,1.022240e+09,Marble Hill-Inwood ...
47,Marine 1,Little West 12th Street/Hudson River,Manhattan,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN